In [1]:
import pandas as pd

In [6]:
csv_path="/Users/aryanpawar/Engineering/Third Year/SEM 1/Machine Learning/Practicals/Problem_13_14/COVID-19 India Gender-wise.csv"

In [7]:
df=pd.read_csv(csv_path)

In [8]:
df.head()

,Sl. No.,State/UT,Doses Administered - Male,Doses Administered - Female
0,1,Andaman and Nicobar Islands,155381,135329
1,2,Andhra Pradesh,9546052,11464881
2,3,Arunachal Pradesh,459689,372145
3,4,Assam,5537684,4792464
4,5,Bihar,12615368,10630449

In [12]:
df.describe()

       Doses Administered - Male  Doses Administered - Female
count               3.800000e+01                 3.800000e+01
mean                1.248683e+07                 1.094278e+07
std                 3.809926e+07                 3.335514e+07
min                 3.583400e+04                 2.949400e+04
25%                 4.442780e+05                 3.812310e+05
50%                 4.927424e+06                 3.985504e+06
75%                 1.087513e+07                 1.062918e+07
max                 2.372498e+08                 2.079128e+08

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 38 entries, 0 to 37
Data columns (total 4 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   Sl. No.                      38 non-null     object
 1   State/UT                     38 non-null     object
 2   Doses Administered - Male    38 non-null     int64
 3   Doses Administered - Female  38 non-null     int64
dtypes: int64(2), object(2)
memory usage: 1.3+ KB

In [14]:
df.shape

(38, 4)

In [15]:
df.columns

Index(['Sl. No.', 'State/UT', 'Doses Administered - Male',
       'Doses Administered - Female'],
      dtype='object')

In [18]:
df.isnull().sum()

Sl. No.                        0
State/UT                       0
Doses Administered - Male      0
Doses Administered - Female    0
dtype: int64

In [20]:
df.head()

,Sl. No.,State/UT,Doses Administered - Male,Doses Administered - Female
0,1,Andaman and Nicobar Islands,155381,135329
1,2,Andhra Pradesh,9546052,11464881
2,3,Arunachal Pradesh,459689,372145
3,4,Assam,5537684,4792464
4,5,Bihar,12615368,10630449

In [22]:
print("Number of Males vaccinated")
df['Doses Administered - Male'].sum()

Number of Males vaccinated

474499684

In [23]:
print("Number of Female vaccinated")
df['Doses Administered - Female'].sum()

Number of Female vaccinated

415825554